# Count Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManager..::..Count Property
MacroManager Class See Also
---
The count.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int Count { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Count As Integer
	Get
```

Visual C++
---
```text
public:
property int Count {
	int get ();
}
```

# See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace